/*******************************************************************
**我们的FPGA开发网
**网站：www.OurFPGA.com
**淘宝：OurFPGA.taobao.com
**邮箱: OurFPGA@gmail.com
**欢迎大家登陆网站，参与FPGA及电子技术讨论，下载免费视频教程及资料
*****************文件信息********************************************
**创建日期：   2011.06.01
**版本号：     version 1.0
**功能描述：   2-4译码器
********************************************************************/

module my_decode(I,E,Y);
input [1:0] I;
input E;
output [3:0]Y;
reg [3:0]Y;  //寄存器定义
always@(I,E)//任何一个变化就执行，组合逻辑
	begin
		if(E)  Y=4'b1111;//当使能为1的时候输出1111
         	else
         			case(I)
         			2'b00:  Y=4'b1110;//当为0译码为1110
         			2'b01:  Y=4'b1101;//当为1译码为1101
         			2'b10:  Y=4'b1011;//当为2译码为1011
         			2'b11:  Y=4'b0111;//当为3译码为0111
         			default:Y=4'b1111;
                  endcase
      end
 endmodule         		